set_property -dict { PACKAGE_PIN E3    IOSTANDARD LVCMOS33 } [get_ports { clk }];
create_clock -period 10.000 -name sys_clk_pin -waveform {0.000 5.000} -add [get_ports { clk }];


set_property -dict { PACKAGE_PIN J15   IOSTANDARD LVCMOS33 } [get_ports { led_sel }];
#set_property -dict { PACKAGE_PIN L16   IOSTANDARD LVCMOS33 } [get_ports { sw[1] }];
#set_property -dict { PACKAGE_PIN M13   IOSTANDARD LVCMOS33 } [get_ports { sw[2] }];
#set_property -dict { PACKAGE_PIN R15   IOSTANDARD LVCMOS33 } [get_ports { sw[3] }];
#set_property -dict { PACKAGE_PIN R17   IOSTANDARD LVCMOS33 } [get_ports { sw[4] }];
#set_property -dict { PACKAGE_PIN T18   IOSTANDARD LVCMOS33 } [get_ports { sw[5] }];
#set_property -dict { PACKAGE_PIN U18   IOSTANDARD LVCMOS33 } [get_ports { sw[6] }];
#set_property -dict { PACKAGE_PIN R13   IOSTANDARD LVCMOS33 } [get_ports { sw[7] }];
#set_property -dict { PACKAGE_PIN T8    IOSTANDARD LVCMOS33 } [get_ports { sw[8] }];
#set_property -dict { PACKAGE_PIN U8    IOSTANDARD LVCMOS33 } [get_ports { sw[9] }];
#set_property -dict { PACKAGE_PIN R16   IOSTANDARD LVCMOS33 } [get_ports { sw[10] }];
#set_property -dict { PACKAGE_PIN T13   IOSTANDARD LVCMOS33 } [get_ports { sw[11] }];
#set_property -dict { PACKAGE_PIN H6    IOSTANDARD LVCMOS33 } [get_ports { sw[12] }];
#set_property -dict { PACKAGE_PIN U12   IOSTANDARD LVCMOS33 } [get_ports { sw[13] }];
#set_property -dict { PACKAGE_PIN U11   IOSTANDARD LVCMOS33 } [get_ports { sw[14] }];
#set_property -dict { PACKAGE_PIN V10   IOSTANDARD LVCMOS33 } [get_ports { sw[15] }];


set_property -dict { PACKAGE_PIN H17   IOSTANDARD LVCMOS33 } [get_ports { leds[0] }];
set_property -dict { PACKAGE_PIN K15   IOSTANDARD LVCMOS33 } [get_ports { leds[1] }];
set_property -dict { PACKAGE_PIN J13   IOSTANDARD LVCMOS33 } [get_ports { leds[2] }];
set_property -dict { PACKAGE_PIN N14   IOSTANDARD LVCMOS33 } [get_ports { leds[3] }];
set_property -dict { PACKAGE_PIN R18   IOSTANDARD LVCMOS33 } [get_ports { leds[4] }];
set_property -dict { PACKAGE_PIN V17   IOSTANDARD LVCMOS33 } [get_ports { leds[5] }];
set_property -dict { PACKAGE_PIN U17   IOSTANDARD LVCMOS33 } [get_ports { leds[6] }];
set_property -dict { PACKAGE_PIN U16   IOSTANDARD LVCMOS33 } [get_ports { leds[7] }];
set_property -dict { PACKAGE_PIN V16   IOSTANDARD LVCMOS33 } [get_ports { leds[8] }];
set_property -dict { PACKAGE_PIN T15   IOSTANDARD LVCMOS33 } [get_ports { leds[9] }];
set_property -dict { PACKAGE_PIN U14   IOSTANDARD LVCMOS33 } [get_ports { leds[10] }];
set_property -dict { PACKAGE_PIN T16   IOSTANDARD LVCMOS33 } [get_ports { leds[11] }];
set_property -dict { PACKAGE_PIN V15   IOSTANDARD LVCMOS33 } [get_ports { leds[12] }];
set_property -dict { PACKAGE_PIN V14   IOSTANDARD LVCMOS33 } [get_ports { leds[13] }];
set_property -dict { PACKAGE_PIN V12   IOSTANDARD LVCMOS33 } [get_ports { leds[14] }];
set_property -dict { PACKAGE_PIN V11   IOSTANDARD LVCMOS33 } [get_ports { leds[15] }];


#set_property -dict { PACKAGE_PIN N17   IOSTANDARD LVCMOS33 } [get_ports { exe }];

## Down Button - BTND (Reset)  
set_property -dict { PACKAGE_PIN P18   IOSTANDARD LVCMOS33 } [get_ports { rst }];


#set_input_delay -clock [get_clocks sys_clk_pin] -min 0.000 [get_ports {sw[*]}];
#set_input_delay -clock [get_clocks sys_clk_pin] -max 2.000 [get_ports {sw[*]}];

## Buttons are asynchronous inputs
#set_input_delay -clock [get_clocks sys_clk_pin] -min 0.000 [get_ports {execute_btn}];
#set_input_delay -clock [get_clocks sys_clk_pin] -max 2.000 [get_ports {execute_btn}];
#set_input_delay -clock [get_clocks sys_clk_pin] -min 0.000 [get_ports {reset_btn}];
#set_input_delay -clock [get_clocks sys_clk_pin] -max 2.000 [get_ports {reset_btn}];


#set_output_delay -clock [get_clocks sys_clk_pin] -min -1.000 [get_ports {led[*]}];
#set_output_delay -clock [get_clocks sys_clk_pin] -max 2.000 [get_ports {led[*]}];


#set_false_path -from [get_ports {sw[*]}] -to [all_registers];
#set_false_path -from [get_ports {execute_btn}] -to [all_registers];
#set_false_path -from [get_ports {reset_btn}] -to [all_registers];

## LEDs are outputs and don't need tight timing
#set_false_path -from [all_registers] -to [get_ports {led[*]}];


#set_property CONFIG_VOLTAGE 3.3 [current_design];
#set_property CFGBVS VCCO [current_design];

## Bitstream Options
#set_property BITSTREAM.GENERAL.COMPRESS TRUE [current_design];
#set_property BITSTREAM.CONFIG.CONFIGRATE 33 [current_design];
#set_property CONFIG_MODE SPIx4 [current_design];